final-versions/unnumbered/V0.0/benchmarks/k6-full-result-vus-800-1-workers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6_benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 800 max VUs, 10m30s max duration (incl. graceful stop):
              * exact_requests: 20000 iterations shared among 800 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.8s), 800/800 VUs, 803 complete and 0 interrupted iterations
exact_requests   [   4% ] 800 VUs  00m00.8s/10m0s  00803/20000 shared iters

running (00m01.8s), 800/800 VUs, 5092 complete and 0 interrupted iterations
exact_requests   [  25% ] 800 VUs  00m01.8s/10m0s  05092/20000 shared iters

running (00m02.8s), 800/800 VUs, 10443 complete and 0 interrupted iterations
exact_requests   [  52% ] 800 VUs  00m02.8s/10m0s  10443/20000 shared iters

running (00m03.8s), 800/800 VUs, 15851 complete and 0 interrupted iterations
exact_requests   [  79% ] 800 VUs  00m03.8s/10m0s  15851/20000 shared iters

running (00m04.8s), 044/800 VUs, 19956 complete and 0 interrupted iterations
exact_requests   [ 100% ] 800 VUs  00m04.8s/10m0s  19956/20000 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 80000  15169.713944/s
    checks_succeeded...: 25.00% 20000 out of 80000
    checks_failed......: 75.00% 60000 out of 80000

    ✓ Success (200 OK)
    ✗ Duplicate ID (409 Conflict)
      ↳  0% — ✓ 0 / ✗ 20000
    ✗ Sold Out (410 Gone)
      ↳  0% — ✓ 0 / ✗ 20000
    ✗ Gateway/DB Error (500+)
      ↳  0% — ✓ 0 / ✗ 20000

    HTTP
    http_req_duration..............: avg=155.31ms min=89.47ms med=122.78ms max=1.06s p(90)=218.66ms p(95)=250.13ms
      { expected_response:true }...: avg=155.86ms min=98.62ms med=122.89ms max=1.06s p(90)=218.98ms p(95)=250.54ms
    http_req_failed................: 0.97%  196 out of 20196
    http_reqs......................: 20196  3829.594285/s

    EXECUTION
    iteration_duration.............: avg=178.13ms min=98.85ms med=123.22ms max=1.86s p(90)=224.57ms p(95)=405.95ms
    iterations.....................: 20000  3792.428486/s
    vus............................: 44     min=44           max=800
    vus_max........................: 800    min=800          max=800

    NETWORK
    data_received..................: 4.9 MB 934 kB/s
    data_sent......................: 2.0 MB 375 kB/s



running (00m05.3s), 000/800 VUs, 20000 complete and 0 interrupted iterations
exact_requests ✓ [ 100% ] 800 VUs  00m05.3s/10m0s  20000/20000 shared iters