final-versions/unnumbered/V0.0/benchmarks/k6-full-result-vus-800-4-workers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6_benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 800 max VUs, 10m30s max duration (incl. graceful stop):
              * exact_requests: 20000 iterations shared among 800 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.8s), 800/800 VUs, 82 complete and 0 interrupted iterations
exact_requests   [   0% ] 800 VUs  00m00.8s/10m0s  00082/20000 shared iters

running (00m01.8s), 800/800 VUs, 3187 complete and 0 interrupted iterations
exact_requests   [  16% ] 800 VUs  00m01.8s/10m0s  03187/20000 shared iters

running (00m02.8s), 800/800 VUs, 8836 complete and 0 interrupted iterations
exact_requests   [  44% ] 800 VUs  00m02.8s/10m0s  08836/20000 shared iters

running (00m03.8s), 800/800 VUs, 14564 complete and 0 interrupted iterations
exact_requests   [  73% ] 800 VUs  00m03.8s/10m0s  14564/20000 shared iters

running (00m04.8s), 014/800 VUs, 19986 complete and 0 interrupted iterations
exact_requests   [ 100% ] 800 VUs  00m04.8s/10m0s  19986/20000 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 80000  15740.159947/s
    checks_succeeded...: 25.00% 20000 out of 80000
    checks_failed......: 75.00% 60000 out of 80000

    ✓ Success (200 OK)
    ✗ Duplicate ID (409 Conflict)
      ↳  0% — ✓ 0 / ✗ 20000
    ✗ Sold Out (410 Gone)
      ↳  0% — ✓ 0 / ✗ 20000
    ✗ Gateway/DB Error (500+)
      ↳  0% — ✓ 0 / ✗ 20000

    HTTP
    http_req_duration..............: avg=147.13ms min=93.21ms med=114.89ms max=4.04s p(90)=135.79ms p(95)=164.54ms
      { expected_response:true }...: avg=147.34ms min=98.27ms med=114.93ms max=4.04s p(90)=136.04ms p(95)=164.78ms
    http_req_failed................: 0.47%  96 out of 20096
    http_reqs......................: 20096  3953.928179/s

    EXECUTION
    iteration_duration.............: avg=178.67ms min=98.81ms med=115.27ms max=5.06s p(90)=137.64ms p(95)=177.01ms
    iterations.....................: 20000  3935.039987/s
    vus............................: 14     min=14          max=800
    vus_max........................: 800    min=800         max=800

    NETWORK
    data_received..................: 4.9 MB 962 kB/s
    data_sent......................: 2.0 MB 388 kB/s



running (00m05.1s), 000/800 VUs, 20000 complete and 0 interrupted iterations
exact_requests ✓ [ 100% ] 800 VUs  00m05.1s/10m0s  20000/20000 shared iters